pruebas/results/2025-11-10_17-21-50/S2_1_proxy_ro_t1.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 105.77 qps: 1694.34 (r/w/o: 1482.59/0.00/211.74) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 83.80 qps: 1341.32 (r/w/o: 1173.73/0.00/167.59) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 153.20 qps: 2451.62 (r/w/o: 2145.22/0.00/306.40) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 192.20 qps: 3072.53 (r/w/o: 2688.14/0.00/384.39) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 197.00 qps: 3153.95 (r/w/o: 2759.96/0.00/393.99) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 199.58 qps: 3193.64 (r/w/o: 2794.48/0.00/399.15) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 189.20 qps: 3025.59 (r/w/o: 2647.19/0.00/378.40) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 194.44 qps: 3112.03 (r/w/o: 2723.15/0.00/388.88) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 194.23 qps: 3105.55 (r/w/o: 2717.28/0.00/388.27) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 194.04 qps: 3107.26 (r/w/o: 2718.98/0.00/388.28) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 194.94 qps: 3116.41 (r/w/o: 2726.73/0.00/389.68) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            146272
        write:                           0
        other:                           20896
        total:                           167168
    transactions:                        10448  (174.12 per sec.)
    queries:                             167168 (2785.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0028s
    total number of events:              10448

Latency (ms):
         min:                                    4.23
         avg:                                    5.74
         max:                                   90.75
         95th percentile:                        6.09
         sum:                                59978.17

Threads fairness:
    events (avg/stddev):           10448.0000/0.00
    execution time (avg/stddev):   59.9782/0.00