pruebas/results/2025-11-10_17-21-50/S2_1_proxy_ro_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 729.91 qps: 11685.02 (r/w/o: 10224.39/0.00/1460.63) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 742.30 qps: 11876.96 (r/w/o: 10392.37/0.00/1484.60) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 738.80 qps: 11820.19 (r/w/o: 10342.59/0.00/1477.60) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 739.40 qps: 11829.13 (r/w/o: 10350.34/0.00/1478.79) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 725.40 qps: 11609.66 (r/w/o: 10158.85/0.00/1450.81) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 734.00 qps: 11741.80 (r/w/o: 10273.80/0.00/1468.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 731.40 qps: 11704.61 (r/w/o: 10241.81/0.00/1462.80) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 704.80 qps: 11276.45 (r/w/o: 9866.85/0.00/1409.61) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 725.39 qps: 11604.89 (r/w/o: 10154.10/0.00/1450.79) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 705.98 qps: 11296.50 (r/w/o: 9884.54/0.00/1411.96) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 730.42 qps: 11690.71 (r/w/o: 10229.87/0.00/1460.84) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 748.01 qps: 11962.08 (r/w/o: 10466.27/0.00/1495.81) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            612962
        write:                           0
        other:                           87566
        total:                           700528
    transactions:                        43783  (729.62 per sec.)
    queries:                             700528 (11673.88 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0071s
    total number of events:              43783

Latency (ms):
         min:                                    4.28
         avg:                                    5.48
         max:                                   23.17
         95th percentile:                        6.32
         sum:                               239926.32

Threads fairness:
    events (avg/stddev):           10945.7500/480.37
    execution time (avg/stddev):   59.9816/0.00