pruebas/results/2025-11-10_17-21-50/S2_1_proxy_ro_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 913.74 qps: 14635.79 (r/w/o: 12806.72/0.00/1829.07) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 930.39 qps: 14881.84 (r/w/o: 13021.46/0.00/1860.38) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 935.01 qps: 14964.83 (r/w/o: 13094.40/0.00/1870.43) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 937.62 qps: 14994.49 (r/w/o: 13119.25/0.00/1875.24) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 931.78 qps: 14910.47 (r/w/o: 13047.31/0.00/1863.16) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 925.41 qps: 14806.21 (r/w/o: 12954.98/0.00/1851.23) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 926.38 qps: 14825.30 (r/w/o: 12972.54/0.00/1852.76) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 928.20 qps: 14848.26 (r/w/o: 12992.05/0.00/1856.21) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 915.61 qps: 14650.28 (r/w/o: 12818.87/0.00/1831.41) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 936.00 qps: 14976.58 (r/w/o: 13104.58/0.00/1872.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 929.61 qps: 14876.62 (r/w/o: 13017.79/0.00/1858.83) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 931.00 qps: 14892.34 (r/w/o: 13030.14/0.00/1862.19) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            779968
        write:                           0
        other:                           111424
        total:                           891392
    transactions:                        55712  (928.36 per sec.)
    queries:                             891392 (14853.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0100s
    total number of events:              55712

Latency (ms):
         min:                                    4.59
         avg:                                    8.61
         max:                                   18.30
         95th percentile:                       14.21
         sum:                               479928.08

Threads fairness:
    events (avg/stddev):           6964.0000/2416.35
    execution time (avg/stddev):   59.9910/0.00